### Pandas to clean data
### pandas to create Series and Dataframe
### series, dataframe, they have index(rows) and columns
### loc (access rows using explicit index, iloc (access rows using implicit index)
### missing values

-combining datasets
-aggregation (groupby)

###combining datasets
-combine multiple datasets into one
-concat
-append
-merge

In [3]:
import pandas as pd
ser1 = pd.Series (["A", "B", "C"], index = [1,2,3])
ser2 = pd.Series (["D", "E", "F"], index = [4,5,6])
ser1

1    A
2    B
3    C
dtype: object

In [4]:
ser2

4    D
5    E
6    F
dtype: object

In [5]:
pd.concat([ser1, ser2]) #combined

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [8]:
ser2 = pd.Series (["D", "E", "F"], index = [1,2,3])
ser3 = pd.concat([ser1,ser2])
ser3

1    A
2    B
3    C
1    D
2    E
3    F
dtype: object

In [9]:
ser3.loc[1]

1    A
1    D
dtype: object

In [11]:
import numpy as np

df5 = pd.DataFrame(np.random.randint(0,11, size=(2,3)), columns=["A","B","C"],
                  index=[1,2])

In [12]:
df5

   A  B  C
1  2  0  0
2  1  9  9

In [15]:
df5["B"] #this is a series #dataframe is putting multiple series together #every column in a dataframe is a series

1    0
2    9
Name: B, dtype: int64

In [17]:
df6 = pd.DataFrame(np.random.randint(0,11, size=(2,3)), columns=["D","B","C"],
                  index=[3,4])
df6

   D  B  C
3  8  0  9
4  8  7  4

In [18]:
pd.concat([df5, df6]) #new column has null values very likely to have missing values

/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     A  B  C    D
1  2.0  0  0  NaN
2  1.0  9  9  NaN
3  NaN  0  9  8.0
4  NaN  7  4  8.0